Repository: eugeneolsen/midiplay
Catalog: po/*.po
Languages: es, pt_br

source: Detected
es: Detectados
pt_br: Detectados

source: MIDI output ports:
es: puertos de salida MIDI:
pt_br: portas de saída MIDI:

source: Connected to:
es: Conectado a:
pt_br: Conectado a:

source: Playing: "
es: Tocando: "
pt_br: Tocando: "

source: in
es: en
pt_br: em

source: verse
es: estrofa

source: at
es: a
pt_br: a

source: bpm
es: ppm

source: Playing introduction
es: Tocando introducción
pt_br: Tocando introdução

source: Playing verse
es: Tocando estrofa
pt_br: Tocando verso

source: , last verse
es: , última estrofa
pt_br: , último verso

source: Warning: Final intro marker not past last NoteOff event
es: Advertencia: El marcador final de introducción no está después del último evento NoteOff
pt_br: Aviso: Marcador final de introdução não está após o último evento NoteOff

source: Elapsed time
es: Tiempo transcurrido

source: Device connection timeout. No device found. Connect a MIDI device and try again.
es: Tiempo de espera de conexión agotado. No se encontró ningún dispositivo. Conecte un dispositivo MIDI e intente nuevamente.
pt_br: Tempo limite de conexão do dispositivo. Nenhum dispositivo encontrado. Conecte um dispositivo MIDI e tente novamente.

source: Cannot convert unknown device type to key
es: No se puede convertir tipo de dispositivo desconocido a clave

source: Cannot create device for unknown or unsupported device type
es: No se puede crear dispositivo para tipo de dispositivo desconocido o no soportado

source: YAML configuration is required. No device configuration found. Please ensure midi_devices.yaml is available in a standard location: ~/.config/midiplay/midi_devices.yaml (user-specific) /etc/midiplay/midi_devices.yaml (system-wide) ./midi_devices.yaml (local)
es: Se requiere configuración YAML. No se encontró configuración de dispositivo. Asegúrese de que midi_devices.yaml esté disponible en una ubicación estándar: ~/.config/midiplay/midi_devices.yaml (específico del usuario) /etc/midiplay/midi_devices.yaml (todo el sistema) ./midi_devices.yaml (local)
pt_br: Configuração YAML é necessária. Nenhuma configuração de dispositivo encontrada. Certifique-se de que midi_devices.yaml está disponível em um local padrão: ~/.config/midiplay/midi_devices.yaml (específico do usuário) /etc/midiplay/midi_devices.yaml (todo o sistema) ./midi_devices.yaml (local)

source: Unknown device
es: Dispositivo desconocido
pt_br: Dispositivo desconhecido

source: Casio CTX-3000 series
es: Serie Casio CTX-3000
pt_br: Série Casio CTX-3000

source: Yamaha PSR-EW425 series
es: Serie Yamaha PSR-EW425
pt_br: Série Yamaha PSR-EW425

source: Allen Protege organ
es: Órgano Allen Protege
pt_br: Órgão Allen Protege

source: YAML configuration file not found. Device configuration is mandatory. Please create midi_devices.yaml in one of these locations: ~/.config/midiplay/midi_devices.yaml (user-specific) /etc/midiplay/midi_devices.yaml (system-wide) ./midi_devices.yaml (local)
es: No se encontró el archivo de configuración YAML. La configuración del dispositivo es obligatoria. Por favor cree midi_devices.yaml en una de estas ubicaciones: ~/.config/midiplay/midi_devices.yaml (específico del usuario) /etc/midiplay/midi_devices.yaml (todo el sistema) ./midi_devices.yaml (local)
pt_br: Arquivo de configuração YAML não encontrado. A configuração do dispositivo é obrigatória. Por favor crie midi_devices.yaml em um destes locais: ~/.config/midiplay/midi_devices.yaml (específico do usuário) /etc/midiplay/midi_devices.yaml (todo o sistema) ./midi_devices.yaml (local)

source: Loaded device configuration from:
es: Configuración de dispositivo cargada desde:
pt_br: Configuração do dispositivo carregada de:

source: Failed to parse YAML configuration file:
es: Error al analizar el archivo de configuración YAML:
pt_br: Falha ao analisar o arquivo de configuração YAML:

source: Please check the file syntax and structure.
es: Por favor, verifique la sintaxis y estructura del archivo.
pt_br: Por favor, verifique a sintaxe e estrutura do arquivo.

source: YAML parsing error:
es: Error de análisis YAML:
pt_br: Erro de análise YAML:

source: Error loading YAML file:
es: Error al cargar el archivo YAML:
pt_br: Erro ao carregar o arquivo YAML:

source: YAML content parsing error:
es: Error de análisis del contenido YAML:
pt_br: Erro de análise do conteúdo YAML:

source: Error parsing YAML content:
es: Error al analizar el contenido YAML:
pt_br: Erro ao analisar o conteúdo YAML:

source: YAML configuration is required for device detection. Cannot detect device type without configuration file.
es: Se requiere configuración YAML para la detección de dispositivos. No se puede detectar el tipo de dispositivo sin el archivo de configuración.
pt_br: Configuração YAML é necessária para detecção de dispositivo. Não é possível detectar o tipo de dispositivo sem o arquivo de configuração.

source: Channel
es: Canal
pt_br: Canal

source: (Bank
es: (Banco
pt_br: (Banco

source: , Program
es: , Programa
pt_br: , Programa

source: Device connection timeout. No device found. Connect a MIDI device and try again.
es: Tiempo de espera de conexión agotado. No se encontró ningún dispositivo. Conecte un dispositivo MIDI e intente nuevamente.
pt_br: Tempo limite de conexão do dispositivo. Nenhum dispositivo encontrado. Conecte um dispositivo MIDI e tente novamente.

source: No device connected. Connect a device.
es: Ningún dispositivo conectado. Conecte un dispositivo.
pt_br: Nenhum dispositivo conectado. Conecte um dispositivo.

source: Fine - elapsed time
es: Fin - tiempo transcurrido
pt_br: Fim - tempo decorrido

source: Hymn
es: Himno
pt_br: Hino

source: was not found
es: no se encontró
pt_br: não foi encontrado

source: in the staging folder.
es: en la carpeta de preparación.
pt_br: na pasta de preparação.

source: Error loading MIDI file:
es: Error al cargar el archivo MIDI:
pt_br: Erro ao carregar o arquivo MIDI:

source: minor
es: menor
pt_br: menor

source: Warning: Deprecated Meta event for number of verses found in MIDI file. Please use the Sequencer-Specific Meta event instead.
es: Advertencia: Se encontró un Meta evento obsoleto para el número de estrofas en el archivo MIDI. Por favor, use el Meta evento específico del secuenciador en su lugar.
pt_br: Aviso: Meta evento obsoleto para número de versos encontrado no arquivo MIDI. Por favor, use o Meta evento específico do sequenciador.

source: Warning: Deprecated Meta event for pause between verses found in MIDI file. Please use the Sequencer-Specific Meta event instead.
es: Advertencia: Se encontró un Meta evento obsoleto para la pausa entre estrofas en el archivo MIDI. Por favor, use el Meta evento específico del secuenciador en su lugar.
pt_br: Aviso: Meta evento obsoleto para pausa entre versos encontrado no arquivo MIDI. Por favor, use o Meta evento específico do sequenciador.

source: Goto option not yet implemented. Starting at the beginning.
es: Opción Goto aún no implementada. Comenzando desde el principio.
pt_br: Opção Goto ainda não implementada. Começando do início.

source: Tempo must be numeric.
es: El tempo debe ser numérico.

source: Invalid option encountered.
es: Opción inválida encontrada.

source: Organ Pi play MIDI file command
es: Comando Organ Pi para reproducir archivos MIDI
pt_br: Comando Organ Pi para tocar arquivos MIDI

source: Version
es: Versión
pt_br: Versão

source: Organ Pi play MIDI file command, version
es: Comando Organ Pi para reproducir archivos MIDI, versión
pt_br: Comando Organ Pi para tocar arquivos MIDI, versão

source: Usage:
es: Uso:
pt_br: Uso:

source: If argument is numeric, start at the measure number; if has alpha, start at marker. (not yet implemented)
es: Si el argumento es numérico, comienza en el número de compás; si tiene caracteres alfabéticos, comienza en el marcador. (aún no implementado)
pt_br: Se o argumento for numérico, começa no número do compasso; se tiver caracteres alfabéticos, começa no marcador. (ainda não implementado)

source: This text.
es: Este texto.
pt_br: Este texto.

source: Play the introduction followed by the specified number of verses.
es: Toca la introducción seguida del número especificado de estrofas.
pt_br: Toca a introdução seguida pelo número especificado de versos.

source: Prelude/postlude. <speed> is optional, default is 9, which is 90%. 10 is 100%. Plays 2 verses by default; can be modified by -x<verses>
es: Preludio/postludio. <speed> es opcional, el valor predeterminado es 9, que es 90%. 10 es 100%. Toca 2 estrofas de forma predeterminada; se puede modificar con -x<estrofas>
pt_br: Prelúdio/poslúdio. <speed> é opcional, o padrão é 9, que é 90%. 10 é 100%. Toca 2 versos por padrão; pode ser modificado com -x<versos>

source: Play the file from the staging directory, if present.
es: Toca el archivo desde el directorio de preparación, si existe.
pt_br: Toca o arquivo do diretório de preparação, se existir.

source: Force tempo to the specified number of beats per minute.
es: Fuerza el tempo al número especificado de pulsaciones por minuto.
pt_br: Força o tempo para o número especificado de batidas por minuto.

source: Version of this command
es: Versión de este comando
pt_br: Versão deste comando

source: Number of verses to play without introduction.
es: Número de estrofas a tocar sin introducción.
pt_br: Número de versos a tocar sem introdução.

source: No filename provided. You must pass an file name to play.
es: No se proporcionó un nombre de archivo. Debe proporcionar un nombre de archivo para tocar.
pt_br: Nenhum nome de arquivo fornecido. Você deve fornecer um nome de arquivo para tocar.

source: Unrecognized argument:
es: Argumento no reconocido:
pt_br: Argumento não reconhecido:

source: Available MIDI ports:
es: Puertos MIDI disponibles:

source: Unknown
es: Desconocido

source: Error:
pt_br: Erro:

source: verse
pt_br: verso

source: Tempo must be numeric. Exiting program.
pt_br: O tempo deve ser numérico. Saindo do programa.
